IRP/src/InformationRegisters/ExpenseRevenueTypeSettings/ExpenseRevenueTypeSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>ExpenseRevenueTypeSettings</name>
 <resources>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </resources>
 <resources>
  <name>RevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemType</name>
  <type>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonModules/CatExpenseAndRevenueTypesServer/Module.bsl
Procedure OnCreateAtServer(Cancel, StandardProcessing, Form, Parameters) Export
	FillingData = Undefined;
	If Parameters.Property("FillingData", FillingData) Then
		Form.FillingData = CommonFunctionsServer.SerializeXMLUseXDTO(FillingData);
	EndIf;

	If Parameters.Property("FormTitle") Then
		Form.Title = Parameters.FormTitle;
		Form.AutoTitle = False;
	EndIf;
EndProcedure

Function GetExpenseType(Company, ItemKey) Export
	Filter = InformationRegisters.ExpenseRevenueTypeSettings.GetFilter();
	Filter.Company  = Company;
	Filter.ItemKey  = ItemKey;
	Filter.Item     = Filter.ItemKey.Item;
	Filter.ItemType = Filter.Item.ItemType;
	Return InformationRegisters.ExpenseRevenueTypeSettings.GetExpenseType(Filter);
EndFunction

Function GetRevenueType(Company, ItemKey) Export
	Filter = InformationRegisters.ExpenseRevenueTypeSettings.GetFilter();
	Filter.Company  = Company;
	Filter.ItemKey  = ItemKey;
	Filter.Item     = Filter.ItemKey.Item;
	Filter.ItemType = Filter.Item.ItemType;
	Return InformationRegisters.ExpenseRevenueTypeSettings.GetRevenueType(Filter);
EndFunction
